[
    {
        "id": 1,
        "title": "18×2 Beyond Youthful Days",
        "synopsis": "A 36‑year‑old Taiwanese game developer named Jimmy loses his company and rediscovers a postcard from 18 years ago, triggering a solo journey to Japan to reconnect with Ami, the Japanese backpacker he fell in love with long ago",
        "banner": "https://ik.imagekit.io/ye9pm1zeog/18x2%20beyond%20youthful%20days.jpg?updatedAt=1753423103953",
        "year": 2024,
        "imdbRating": 7.3,
        "genres": [
            "Romance",
            "Drama"
        ]
    },
    {
        "id": 2,
        "title": "20th Century Girl",
        "synopsis": "In 1999, a bright‑hearted high school girl Bo‑ra helps her sick friend by researching Yeon‑doo's school crush—only to fall in love with his best friend, Woon‑ho. As misunderstandings and longing unfold, their teenage friendship becomes unforgettable",
        "banner": "https://ik.imagekit.io/ye9pm1zeog/20th%20century%20girl.jpg?updatedAt=1753423047014",
        "year": 2022,
        "imdbRating": 7.4,
        "genres": [
            "Romance",
            "Drama"
        ]
    },
    {
        "id": 3,
        "title": "Drawing Closer",
        "synopsis": "Two 17-year-olds—Akito, diagnosed with a heart tumor and only one year left to live, and Haruna, who has just six months—meet on a hospital rooftop and forge a deep bond that brings meaning and hope into their limited time together",
        "banner": "https://ik.imagekit.io/ye9pm1zeog/Drawing%20Closer.jpg?updatedAt=1753423072284",
        "year": 2024,
        "imdbRating": 7.6,
        "genres": [
            "Drama",
            "Romance"
        ]
    },
    {
        "id": 4,
        "title": "Man in Love",
        "synopsis": "A Cheng, a tough-but-kind debt collector, strikes a peculiar deal: he offers to gradually pay off Hao Ting's overwhelming debt if she agrees to go on dates with him. What starts as awkward compensation turns into an emotional romance, forcing both to confront their pasts and pursue redemption.",
        "banner": "https://ik.imagekit.io/ye9pm1zeog/man%20in%20love.jpg?updatedAt=1753423157517",
        "year": 2021,
        "imdbRating": 7.1,
        "genres": [
            "Romance",
            "Drama"
        ]
    },
    {
        "id": 5,
        "title": "Your Eyes Tell",
        "synopsis": "A former kickboxer burdened by his criminal past falls in love with a blind woman whose life was changed by a tragic accident. As their bond deepens, he discovers a painful connection between his past and her present.",
        "banner": "https://ik.imagekit.io/ye9pm1zeog/your%20eyes%20tell.jpg?updatedAt=1753423189277",
        "year": 2020,
        "imdbRating": 7.1,
        "genres": [
            "Romance",
            "Drama"
        ]
    },
    {
        "id": 6,
        "title": "Be with you",
        "synopsis": "After his wife's death, a man lives with his young son. One rainy day, she mysteriously returns with no memory of her past. Together, they rediscover love and family.",
        "banner": "https://ik.imagekit.io/ye9pm1zeog/Be_with_You_(Korean_Movie)-P1.jpg?updatedAt=1753418261302",
        "year": 2018,
        "imdbRating": 7.6,
        "genres": [
            "Drama",
            "Fantasy",
            "Romance"
        ]
    },
    {
        "id": 7,
        "title": "One day",
        "synopsis": "Denchai, a shy IT guy secretly loves his colleague Nui. During a company trip in Hokkaido, Nui suffers a temporary 24-hour memory loss. Denchai seizes the chance to pretend they are dating and spends a heartfelt day with her as her \"boyfriend.\" When her memory returns, Nui feels betrayed and must decide whom to trust.",
        "banner": "https://ik.imagekit.io/ye9pm1zeog/one%20day.jpg?updatedAt=1753535464728",
        "year": 2016,
        "imdbRating": 7.9,
        "genres": [
            "Drama",
            "Romance"
        ]
    },
    {
        "id": 8,
        "title": "Friend Zone",
        "synopsis": "Palm has been best friends with Gink for 10 years and secretly loves her. She always says being friends is enough. When Gink breaks up and asks him for support—even across countries—Palm helps. One day, she wonders what would happen if they became more than friends.",
        "banner": "https://ik.imagekit.io/ye9pm1zeog/friend%20zone%202019.jpg?updatedAt=1753535464788",
        "year": 2019,
        "imdbRating": 7.4,
        "genres": [
            "Romance",
            "Comedy"
        ]
    },
    {
        "id": 9,
        "title": "Fight Club",
        "synopsis": "An insomniac white-collar worker (Edward Norton) becomes bored with his life until he meets the charismatic Tyler Durden (Brad Pitt). They start an underground fight club to relieve frustration. As the club grows and turns into a dangerous movement called Project Mayhem",
        "banner": "https://ik.imagekit.io/ye9pm1zeog/fight%20club.jpg?updatedAt=1753538443491",
        "year": 1999,
        "imdbRating": 8.8,
        "genres": [
            "Drama",
            "Thriller"
        ]
    }
]